# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_container_registry.altinncr: Reading...
data.azurerm_container_registry.altinncr: Read complete after 1s [id=/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # kubectl_manifest.flux_config will be destroyed
  # (because kubectl_manifest.flux_config is not in configuration)
  - resource "kubectl_manifest" "flux_config" {
      - api_version             = "source.toolkit.fluxcd.io/v1beta2" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/source.toolkit.fluxcd.io/v1beta2/namespaces/flux-system/ocirepositorys/flux-config" -> null
      - kind                    = "OCIRepository" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "88fbb8d1-a536-4d1c-a7ec-a1555122b44c" -> null
      - name                    = "flux-config" -> null
      - namespace               = "flux-system" -> null
      - server_side_apply       = false -> null
      - uid                     = "88fbb8d1-a536-4d1c-a7ec-a1555122b44c" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1beta2
            kind: OCIRepository
            metadata:
              name: flux-config
              namespace: flux-system
            spec:
              interval: 5m
              provider: azure
              ref:
                tag: admin-test
              url: oci://altinncr.azurecr.io/manifests/config
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.flux_config_kustomize will be destroyed
  # (because kubectl_manifest.flux_config_kustomize is not in configuration)
  - resource "kubectl_manifest" "flux_config_kustomize" {
      - api_version             = "kustomize.toolkit.fluxcd.io/v1beta2" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/kustomize.toolkit.fluxcd.io/v1beta2/namespaces/flux-system/kustomizations/flux-config" -> null
      - kind                    = "Kustomization" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "02c062ec-44c6-46aa-97a9-ad340f2232fa" -> null
      - name                    = "flux-config" -> null
      - namespace               = "flux-system" -> null
      - server_side_apply       = false -> null
      - uid                     = "02c062ec-44c6-46aa-97a9-ad340f2232fa" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: kustomize.toolkit.fluxcd.io/v1beta2
            kind: Kustomization
            metadata:
              name: flux-config
              namespace: flux-system
            spec:
              interval: 5m
              path: ./
              prune: true
              retryInterval: 5m
              sourceRef:
                kind: OCIRepository
                name: flux-config
              timeout: 2m
              wait: true
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.flux_traefik_kustomization will be created
  + resource "kubectl_manifest" "flux_traefik_kustomization" {
      + api_version             = "kustomize.toolkit.fluxcd.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Kustomization"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "traefik"
      + namespace               = "flux-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kustomize.toolkit.fluxcd.io/v1
            kind: Kustomization
            metadata:
              name: traefik
              namespace: flux-system
            spec:
              interval: 5m
              patches:
              - patch: |-
                  apiVersion: helm.toolkit.fluxcd.io/v2
                  kind: HelmRelease
                  metadata:
                    name: altinn-traefik
                  spec:
                    values:
                      service:
                        spec:
                          externalTrafficPolicy: Local
                        ipFamilyPolicy: PreferDualStack
                        ipFamilies:
                          - IPv4
                          - IPv6
                        annotations:
                          service.beta.kubernetes.io/azure-load-balancer-resource-group: MC_admin-test-rg_admin-test-aks_norwayeast
                          service.beta.kubernetes.io/azure-load-balancer-ipv4: 20.251.137.126
                          service.beta.kubernetes.io/azure-load-balancer-ipv6: 2603:1020:e01:4::e5
                target:
                  kind: HelmRelease
                  name: altinn-traefik
              path: ./
              prune: true
              retryInterval: 5m
              sourceRef:
                kind: OCIRepository
                name: traefik
              timeout: 5m
              wait: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_traefik_ocirepo will be created
  + resource "kubectl_manifest" "flux_traefik_ocirepo" {
      + api_version             = "source.toolkit.fluxcd.io/v1beta2"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "OCIRepository"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "traefik"
      + namespace               = "flux-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1beta2
            kind: OCIRepository
            metadata:
              name: traefik
              namespace: flux-system
            spec:
              interval: 5m
              provider: azure
              ref:
                tag: latest
              url: oci://altinncr.azurecr.io/manifests/infra/traefik
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_whoami_kustomization will be created
  + resource "kubectl_manifest" "flux_whoami_kustomization" {
      + api_version             = "kustomize.toolkit.fluxcd.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Kustomization"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "whoami"
      + namespace               = "flux-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kustomize.toolkit.fluxcd.io/v1
            kind: Kustomization
            metadata:
              name: whoami
              namespace: flux-system
            spec:
              interval: 5m
              path: ./
              prune: true
              retryInterval: 5m
              sourceRef:
                kind: OCIRepository
                name: whoami
              timeout: 5m
              wait: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_whoami_ocirepo will be created
  + resource "kubectl_manifest" "flux_whoami_ocirepo" {
      + api_version             = "source.toolkit.fluxcd.io/v1beta2"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "OCIRepository"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "whoami"
      + namespace               = "flux-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1beta2
            kind: OCIRepository
            metadata:
              name: whoami
              namespace: flux-system
            spec:
              interval: 5m
              provider: azure
              ref:
                tag: latest
              url: oci://altinncr.azurecr.io/manifests/infra/whoami
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.traefik_helm_values_configmap will be destroyed
  # (because kubectl_manifest.traefik_helm_values_configmap is not in configuration)
  - resource "kubectl_manifest" "traefik_helm_values_configmap" {
      - api_version             = "v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/api/v1/namespaces/traefik/configmaps/traefik-helm-values" -> null
      - kind                    = "ConfigMap" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "81009f95-8caa-4dd5-b92f-ed4becfbaf9b" -> null
      - name                    = "traefik-helm-values" -> null
      - namespace               = "traefik" -> null
      - server_side_apply       = false -> null
      - uid                     = "81009f95-8caa-4dd5-b92f-ed4becfbaf9b" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              values.yaml: |
                service:
                  annotations:
                    service.beta.kubernetes.io/azure-load-balancer-resource-group: MC_admin-test-rg_admin-test-aks_norwayeast
                    service.beta.kubernetes.io/azure-load-balancer-ipv4: 20.251.137.126
                    service.beta.kubernetes.io/azure-load-balancer-ipv6: 2603:1020:e01:4::e5
            kind: ConfigMap
            metadata:
              name: traefik-helm-values
              namespace: traefik
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # kubectl_manifest.traefik_namespace will be destroyed
  # (because kubectl_manifest.traefik_namespace is not in configuration)
  - resource "kubectl_manifest" "traefik_namespace" {
      - api_version             = "v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/api/v1/namespaces/traefik" -> null
      - kind                    = "Namespace" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "cde90903-2bc0-4c06-bff0-43edb5ac5aa4" -> null
      - name                    = "traefik" -> null
      - server_side_apply       = false -> null
      - uid                     = "cde90903-2bc0-4c06-bff0-43edb5ac5aa4" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: traefik
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan`